In [1]:
import pandas_datareader.data as pdr
import pandas as pd
import datetime as dt
import math
import yfinance as yfin


yfin.pdr_override()

In [2]:
start = dt.datetime(1900, 1, 29)
end = dt.datetime.now()
sp500 = pdr.get_data_yahoo('^GSPC', start, end)

sp500

[*********************100%%**********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1927-12-30,17.660000,17.660000,17.660000,17.660000,17.660000,0
1928-01-03,17.760000,17.760000,17.760000,17.760000,17.760000,0
1928-01-04,17.719999,17.719999,17.719999,17.719999,17.719999,0
1928-01-05,17.549999,17.549999,17.549999,17.549999,17.549999,0
1928-01-06,17.660000,17.660000,17.660000,17.660000,17.660000,0
...,...,...,...,...,...,...
2023-09-01,4530.600098,4541.250000,4501.350098,4515.770020,4515.770020,3246260000
2023-09-05,4510.060059,4514.290039,4496.009766,4496.830078,4496.830078,3526250000
2023-09-06,4490.350098,4490.350098,4442.379883,4465.479980,4465.479980,3418850000
2023-09-07,4434.549805,4457.810059,4430.459961,4451.140137,4451.140137,3763760000
2023-09-08,4451.299805,4473.529785,4448.379883,4457.490234,4457.490234,3259290000

In [3]:
sp500.columns

Index(['Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [4]:
sp500.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 24037 entries, 1927-12-30 to 2023-09-08
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       24037 non-null  float64
 1   High       24037 non-null  float64
 2   Low        24037 non-null  float64
 3   Close      24037 non-null  float64
 4   Adj Close  24037 non-null  float64
 5   Volume     24037 non-null  int64
dtypes: float64(5), int64(1)
memory usage: 1.3 MB

In [5]:
sp500_calc = sp500[['Adj Close']]
sp500_calc = sp500_calc.rename(columns={'Adj Close': 'value'})  # change column name to value
sp500_calc['pct_change'] = sp500_calc['value'].pct_change()
sp500_calc

                  value  pct_change
Date
1927-12-30    17.660000         NaN
1928-01-03    17.760000    0.005663
1928-01-04    17.719999   -0.002252
1928-01-05    17.549999   -0.009594
1928-01-06    17.660000    0.006268
...                 ...         ...
2023-09-01  4515.770020    0.001799
2023-09-05  4496.830078   -0.004194
2023-09-06  4465.479980   -0.006972
2023-09-07  4451.140137   -0.003211
2023-09-08  4457.490234    0.001427

[24037 rows x 2 columns]

In [6]:
sp500_calc['cum_return'] = (1 + sp500_calc['pct_change']).cumprod()
sp500_calc

                  value  pct_change  cum_return
Date
1927-12-30    17.660000         NaN         NaN
1928-01-03    17.760000    0.005663    1.005663
1928-01-04    17.719999   -0.002252    1.003397
1928-01-05    17.549999   -0.009594    0.993771
1928-01-06    17.660000    0.006268    1.000000
...                 ...         ...         ...
2023-09-01  4515.770020    0.001799  255.706119
2023-09-05  4496.830078   -0.004194  254.633642
2023-09-06  4465.479980   -0.006972  252.858438
2023-09-07  4451.140137   -0.003211  252.046443
2023-09-08  4457.490234    0.001427  252.406018

[24037 rows x 3 columns]

In [7]:
total_ret = sp500_calc['cum_return'][-1]
start = dt.datetime(1970, 1, 1) + dt.timedelta(seconds=sp500_calc.index[0].timestamp())
end =  dt.datetime(1970, 1, 1) + dt.timedelta(seconds=sp500_calc.index[-1].timestamp())
period_days = (end - start).days
period_years = period_days / 365.25
period_years

95.69062286105407

In [8]:
CAGR = (total_ret)**(1/period_years)-1
CAGR*100

5.950441331665135

# Including Dividends

In [9]:
# actions = pdr.DataReader('^GSPC', 'yahoo-actions', start, end)  # not working
# actions.head()

In [10]:
sp500_dividend = pd.read_csv("data/multpl/s-p-500-dividend-yield.csv")
sp500_dividend.head(5)

           Date  Value
0  Sep 30, 2023  1.52%
1  Aug 31, 2023  1.54%
2  Jul 31, 2023  1.52%
3  Jun 30, 2023  1.58%
4  May 31, 2023  1.65%

In [11]:
sp500_dividend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1833 entries, 0 to 1832
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1833 non-null   object
 1   Value   1833 non-null   object
dtypes: object(2)
memory usage: 28.8+ KB

In [12]:
sp500_dividend['Date'] = sp500_dividend['Date'].astype('<M8[ns]')
sp500_dividend.dtypes

Date     datetime64[ns]
Value            object
dtype: object

In [13]:
sp500_dividend['Value'] = sp500_dividend['Value'].str.replace('%', '')
sp500_dividend['Value'] = sp500_dividend['Value'].astype('float')
sp500_dividend['Value'] = sp500_dividend['Value'] / 100
sp500_dividend.dtypes

Date     datetime64[ns]
Value           float64
dtype: object

In [14]:
sp500_dividend.sample(5)

           Date   Value
1588 1891-05-31  0.0444
196  2007-05-31  0.0172
1704 1881-09-30  0.0488
897  1948-12-31  0.0612
1052 1936-01-31  0.0349

In [15]:
sp500_dividend = sp500_dividend.set_index('Date').rename(columns={'Value':'dividend_yield'})

In [16]:
sp500_dividend.head(5)

            dividend_yield
Date
2023-09-30          0.0152
2023-08-31          0.0154
2023-07-31          0.0152
2023-06-30          0.0158
2023-05-31          0.0165

In [17]:
sp500_dividend['dividend_yield'] = sp500_dividend['dividend_yield'] / 12
sp500_dividend

            dividend_yield
Date
2023-09-30        0.001267
2023-08-31        0.001283
2023-07-31        0.001267
2023-06-30        0.001317
2023-05-31        0.001375
...                    ...
1871-05-31        0.004458
1871-04-30        0.004575
1871-03-31        0.004700
1871-02-28        0.004817
1871-01-31        0.004883

[1833 rows x 1 columns]

In [18]:
sp500_monthly = sp500_calc.resample('M').last()
sp500_monthly

                  value  pct_change  cum_return
Date
1927-12-31    17.660000         NaN         NaN
1928-01-31    17.570000    0.004574    0.994904
1928-02-29    17.260000    0.005828    0.977350
1928-03-31    19.280001    0.017414    1.091733
1928-04-30    19.750000    0.003557    1.118347
...                 ...         ...         ...
2023-05-31  4179.830078   -0.006109  236.683472
2023-06-30  4450.379883    0.012269  252.003393
2023-07-31  4588.959961    0.001469  259.850510
2023-08-31  4507.660156   -0.001597  255.246897
2023-09-30  4457.490234    0.001427  252.406018

[1150 rows x 3 columns]

In [19]:
sp500_monthly['pct_change'] = sp500_monthly['value'].pct_change()
sp500_monthly.tail()

                  value  pct_change  cum_return
Date
2023-05-31  4179.830078    0.002482  236.683472
2023-06-30  4450.379883    0.064727  252.003393
2023-07-31  4588.959961    0.031139  259.850510
2023-08-31  4507.660156   -0.017716  255.246897
2023-09-30  4457.490234   -0.011130  252.406018

In [20]:
sp500_dividend.head()

            dividend_yield
Date
2023-09-30        0.001267
2023-08-31        0.001283
2023-07-31        0.001267
2023-06-30        0.001317
2023-05-31        0.001375

In [21]:
sp500_monthly = sp500_monthly.merge(sp500_dividend, left_index=True, right_index=True)
sp500_monthly

                  value  pct_change  cum_return  dividend_yield
Date
1927-12-31    17.660000         NaN         NaN        0.003675
1928-01-31    17.570000   -0.005096    0.994904        0.003692
1928-02-29    17.260000   -0.017644    0.977350        0.003767
1928-03-31    19.280001    0.117034    1.091733        0.003608
1928-04-30    19.750000    0.024378    1.118347        0.003425
...                 ...         ...         ...             ...
2023-05-31  4179.830078    0.002482  236.683472        0.001375
2023-06-30  4450.379883    0.064727  252.003393        0.001317
2023-07-31  4588.959961    0.031139  259.850510        0.001267
2023-08-31  4507.660156   -0.017716  255.246897        0.001283
2023-09-30  4457.490234   -0.011130  252.406018        0.001267

[1150 rows x 4 columns]

In [22]:
sp500_monthly.drop(columns='cum_return', inplace=True)
sp500_monthly.tail()

                  value  pct_change  dividend_yield
Date
2023-05-31  4179.830078    0.002482        0.001375
2023-06-30  4450.379883    0.064727        0.001317
2023-07-31  4588.959961    0.031139        0.001267
2023-08-31  4507.660156   -0.017716        0.001283
2023-09-30  4457.490234   -0.011130        0.001267

In [23]:
# calculate the ture total return
sp500_monthly['return'] = sp500_monthly['pct_change'] + sp500_monthly['dividend_yield']
sp500_monthly.tail()

                  value  pct_change  dividend_yield    return
Date
2023-05-31  4179.830078    0.002482        0.001375  0.003857
2023-06-30  4450.379883    0.064727        0.001317  0.066044
2023-07-31  4588.959961    0.031139        0.001267  0.032406
2023-08-31  4507.660156   -0.017716        0.001283 -0.016433
2023-09-30  4457.490234   -0.011130        0.001267 -0.009863

In [43]:
def cagr(_df):
    df = _df.copy()
    df.sort_index(ascending=True)
    df['cum_return'] = (1+ df['return']).cumprod()
    print(df)
    total_ret = df['cum_return'][-1]
    start = dt.datetime(1970, 1, 1) + dt.timedelta(seconds=df.index[0].timestamp())
    end =  dt.datetime(1970, 1, 1) + dt.timedelta(seconds=df.index[-1].timestamp())
    total_period = (end-start).days / 365.25
    CAGR = (total_ret) ** (1/total_period) -1
    return CAGR

In [44]:
print(cagr(sp500_monthly))

                  value  pct_change  dividend_yield    return   cum_return
Date
1927-12-31    17.660000         NaN        0.003675       NaN          NaN
1928-01-31    17.570000   -0.005096        0.003692 -0.001405     0.998595
1928-02-29    17.260000   -0.017644        0.003767 -0.013877     0.984738
1928-03-31    19.280001    0.117034        0.003608  0.120642     1.103539
1928-04-30    19.750000    0.024378        0.003425  0.027803     1.134220
...                 ...         ...             ...       ...          ...
2023-05-31  4179.830078    0.002482        0.001375  0.003857  7733.682070
2023-06-30  4450.379883    0.064727        0.001317  0.066044  8244.446386
2023-07-31  4588.959961    0.031139        0.001267  0.032406  8511.612610
2023-08-31  4507.660156   -0.017716        0.001283 -0.016433  8371.740797
2023-09-30  4457.490234   -0.011130        0.001267 -0.009863  8289.168150

[1150 rows x 5 columns]
0.09881657242493613

# volatility and sharpe ratio